test_scripts/downloads.yml
config:
  target: "https://packages-acceptance.chef.io"
  defaults:
    headers:
      Authorization: 'Basic bWl4bGliLWluc3RhbGw6JW1LUHR6YlQxSkgxd20zMzNramtranMzOW9ldUZMZ1o4dk5vT2RMQlBkKVRaQUpzVVJzOXcwSGxvV1IkbDZo'
      Content-Type: 'text/plain'
  phases:
    - duration: 10
      arrivalRate: 2
      rampTo: 10
  payload:
    path: "../payloads/downloads.csv"
    fields:
      - url

scenarios:
  - flow:
    - head:
       url: "{{ url }}"